Revit 2027 API
SpecTypeId.HvacEnergy Property
 Energy, in discipline Energy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HvacEnergy { get; }
Public Shared ReadOnly Property HvacEnergy As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HvacEnergy {
	ForgeTypeId^ get ();
}
static member HvacEnergy : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace